fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Плановые отпуска сотрудников на год.</comment>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <comment>Год, на который составлен график.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Параметры.АдресДанных) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Запланированные отпуска на %1 год'"), Формат(Параметры.Год, "ЧГ=0"));

	ПостроитьДиаграмму(ПолучитьИзВременногоХранилища(Параметры.АдресДанных));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Строит диаграмму Ганта по данным графика отпусков: точка - сотрудник,
// интервал - период его отпуска.
//
// Параметры:
//  ДанныеОтпусков - ТаблицаЗначений, Неопределено - строки графика отпусков
//                   с колонками Сотрудник, ДатаНачала, ДатаОкончания.
//
&НаСервере
Процедура ПостроитьДиаграмму(ДанныеОтпусков)

	// Перерисовка отключается на время заполнения и включается после него:
	// у диаграммы Ганта это свойство, а не метод обновления.
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();

	Если ТипЗнч(ДанныеОтпусков) <> Тип("ТаблицаЗначений") Тогда
		ДиаграммаГанта.Обновление = Истина;
		Возврат;
	КонецЕсли;

	Серия = ДиаграммаГанта.УстановитьСерию(НСтр("ru = 'Отпуск'"));

	Для Каждого СтрокаОтпуска Из ДанныеОтпусков Цикл

		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;

		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаОтпуска.Сотрудник);

		ЗначениеДиаграммы = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = ЗначениеДиаграммы.Добавить();
		Интервал.Начало = НачалоДня(СтрокаОтпуска.ДатаНачала);
		Интервал.Конец = КонецДня(СтрокаОтпуска.ДатаОкончания);
		Интервал.Текст = Формат(СтрокаОтпуска.ДатаНачала, "ДЛФ=D")
			+ " - " + Формат(СтрокаОтпуска.ДатаОкончания, "ДЛФ=D");

	КонецЦикла;

	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
